tutorials/uweBourdonFancyReference/uweBourdonBoringReference/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

cellsRadial 50; // mesh resolution 
cellsAxial 50; // mesh resolution

rInner 59; //inner radius
rOuter 65; //outer radius
zFinal 24; //length of simulation
zStart 0;

const 0.707;
ratio 0.4;

rInnerAdjusted #calc "$rInner*$const";
rOuterAdjusted #calc "$rOuter*$const";

//d1pos #calc "$ratio1*$ra1*sin(degToRad(45.0))";

vertices
(
    // 0 - inlet - on x-axis - close
	(0			$rInner 				$zStart)
	
	// 1 - outlet - on x-axis - close
	(0 			$rInner  			$zFinal)
	
	// 2 - outlet - on x-axis - far
    (0 			$rOuter  			$zFinal)
	
	// 3 - inlet - on x-axis - far
    (0 			$rOuter 			$zStart)
	
    // 4 - inlet - on y-axis - close	
    ($rInner  		0 		$zStart)
	
    // 5 - outlet - on y-axis - close	
    ($rInner  		0 		$zFinal)
    
    // 6 - outlet - on y-axis - far	
	($rOuter  		0 	$zFinal)
	
    // 7 - inlet - on y-axis - far	
    ($rOuter  		0 	$zStart)
);

blocks
(
    hex (4 5 6 7 0 1 2 3) ($cellsAxial $cellsRadial $cellsRadial) simpleGrading (1 $ratio 1)
	//z axis - y axis - x axis
);

edges
(
arc 0 4 ($rInnerAdjusted $rInnerAdjusted $zStart)
arc 3 7 ($rOuterAdjusted $rOuterAdjusted $zStart)

arc 1 5 ($rInnerAdjusted $rInnerAdjusted $zFinal)
arc 2 6 ($rOuterAdjusted $rOuterAdjusted $zFinal)
);

defaultPatch
{
    name innerRadius;
    type wall;
} 

boundary
(
rightHand
	{
	type patch;
	faces
	(
	(0 3 7 4)
	);
	}

outerRadius
	{
	type patch;
	faces
	(
	(3 7 2 6)
	);
	}

leftHand
	{
	type patch;
	faces
	(
	(1 2 6 5)
	);
	}

outlet
	{
	type patch;
	faces
	(
	(0 1 2 3)
	);
	}

inlet
	{
	type patch;
	faces
	(
	(4 5 6 7)
	);
	}
	
);
mergePatchPairs
(
);